/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: macuguen <macuguen@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/04/03 23:56:58 by macuguen          #+#    #+#             */
/*   Updated: 2018/04/04 20:43:04 by macuguen         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "includes/ft_printf.h"
#include "locale.h"

int main(void)
{
	setlocale(LC_ALL, "");	
	printf("{%30S}\n", L"我是一只猫。");
	ft_printf("{%30S}\n", L"我是一只猫。");
	printf("{%-30S}\n", L"我是一只猫。");
	ft_printf("{%-30S}\n", L"我是一只猫。");
	return (0);
}
